### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.metrics_portal.azurerm_container_app_job.import will be created
  + resource "azurerm_container_app_job" "import" {
      + container_app_environment_id = "/subscriptions/02a23258-2e41-433c-8e9a-465b99e77bca/resourceGroups/dx-p-itn-common-rg-01/providers/Microsoft.App/managedEnvironments/dx-p-itn-common-cae-01"
      + event_stream_endpoint        = (known after apply)
      + id                           = (known after apply)
      + location                     = "italynorth"
      + name                         = "dx-p-itn-metrics-import-caj-01"
      + outbound_ip_addresses        = (known after apply)
      + replica_retry_limit          = 1
      + replica_timeout_in_seconds   = 14400
      + resource_group_name          = "dx-p-itn-common-rg-01"
      + tags                         = {
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "Developer Experience"
          + "Owner"          = "DevEx"
          + "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/prod"
        }
      + workload_profile_name        = "Consumption"

      + identity {
          + identity_ids = [
              + "/subscriptions/02a23258-2e41-433c-8e9a-465b99e77bca/resourceGroups/dx-p-itn-common-rg-01/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dx-p-itn-common-cae-id-01",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + schedule_trigger_config {
          + cron_expression          = "0 3 * * *"
          + parallelism              = 1
          + replica_completion_count = 1
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "ghcr.io/pagopa/dx-metrics-import:latest"
              + memory            = "1Gi"
              + name              = "metrics-import"

              + env {
                  + name        = "DATABASE_URL"
                  + secret_name = "database-url"
                }
              + env {
                  + name        = "GITHUB_APP_ID"
                  + secret_name = "github-app-id"
                }
              + env {
                  + name        = "GITHUB_APP_INSTALLATION_ID"
                  + secret_name = "github-app-installation-id"
                }
              + env {
                  + name        = "GITHUB_APP_PRIVATE_KEY"
                  + secret_name = "github-app-private-key"
                }
              + env {
                  + name  = "IMPORT_SINCE_DAYS"
                  + value = "30"
                }
              + env {
                  + name  = "NODE_ENV"
                  + value = "production"
                }
            }
        }
    }

  # module.metrics_portal.azurerm_key_vault_secret.github_app_id will be created
  + resource "azurerm_key_vault_secret" "github_app_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/02a23258-2e41-433c-8e9a-465b99e77bca/resourceGroups/dx-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/dx-p-itn-common-kv-01"
      + name                    = "dx-metrics-github-app-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value_wo                = (write-only attribute)
      + value_wo_version        = 1
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.metrics_portal.azurerm_key_vault_secret.github_app_installation_id will be created
  + resource "azurerm_key_vault_secret" "github_app_installation_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/02a23258-2e41-433c-8e9a-465b99e77bca/resourceGroups/dx-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/dx-p-itn-common-kv-01"
      + name                    = "dx-metrics-github-app-installation-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value_wo                = (write-only attribute)
      + value_wo_version        = 1
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.metrics_portal.azurerm_key_vault_secret.github_app_private_key will be created
  + resource "azurerm_key_vault_secret" "github_app_private_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/02a23258-2e41-433c-8e9a-465b99e77bca/resourceGroups/dx-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/dx-p-itn-common-kv-01"
      + name                    = "dx-metrics-github-app-private-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value_wo                = (write-only attribute)
      + value_wo_version        = 1
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.metrics_portal.module.container_app.azapi_resource.managed_certificate[0] will be updated in-place
  ~ resource "azapi_resource" "managed_certificate" {
        id                        = "/subscriptions/02a23258-2e41-433c-8e9a-465b99e77bca/resourceGroups/dx-p-itn-common-rg-01/providers/Microsoft.App/managedEnvironments/dx-p-itn-common-cae-01/managedCertificates/cert-metrics-dx-pagopa-it"
        name                      = "cert-metrics-dx-pagopa-it"
      ~ output                    = {
          - id         = "/subscriptions/02a23258-2e41-433c-8e9a-465b99e77bca/resourceGroups/dx-p-itn-common-rg-01/providers/Microsoft.App/managedEnvironments/dx-p-itn-common-cae-01/managedCertificates/cert-metrics-dx-pagopa-it"
          - properties = {
              - provisioningState = "Succeeded"
            }
          - type       = "Microsoft.App/managedEnvironments/managedCertificates"
        } -> (known after apply)
      + tags                      = {
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_container_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "4.2.0"
          + "Owner"          = "DevEx"
          + "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/prod"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.container_app_infra.azurerm_monitor_diagnostic_setting.container_app_environment,
  on .terraform/modules/container_app_infra/monitoring.tf line 3, in resource "azurerm_monitor_diagnostic_setting" "container_app_environment":
   3: resource "azurerm_monitor_diagnostic_setting" "container_app_environment" {

`metric` has been deprecated in favour of the `enabled_metric` property and
will be removed in v5.0 of the AzureRM provider

(and one more similar warning elsewhere)
```

</details>
